Revit 2024 API
BasePoint.Position Property
 Position of the BasePoint.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019.2
Syntax
C#
public XYZ Position { get; }
Visual Basic
Public ReadOnly Property Position As XYZ
	Get
Visual C++
public:
property XYZ^ Position {
	XYZ^ get ();
}
See Also
BasePoint Class
Autodesk.Revit.DB Namespace